EldermarkExchangeNew/eldermark-exchange-core-services/src/main/resources/xds/xds_submit_document_set.xml

<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:axis2="http://ws.apache.org/namespaces/axis2" xmlns:axis2ns1="urn:ihe:iti:xds-b:2007" xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xsi:schemaLocation="urn:ihe:iti:xds-b:2007 ../schema/IHE/XDS.b_DocumentRepository.xsd">
    <soap12:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
        <wsa:To>$RegistryURL</wsa:To>
        <wsa:MessageID>$MessageId</wsa:MessageID>
        <wsa:Action>urn:ihe:iti:2007:RegisterDocumentSet-b</wsa:Action>
    </soap12:Header>

    <soap12:Body>

        <lcm:SubmitObjectsRequest>
        <rim:RegistryObjectList>
            <rim:ExtrinsicObject id="$docUUID" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1" mimeType="$mimeType">
                <rim:Slot name="repositoryUniqueId">
                    <rim:ValueList>
                        <rim:Value>$repositoryUniqueId</rim:Value>
                    </rim:ValueList>
                </rim:Slot>
                <rim:Slot name="creationTime">
                    <rim:ValueList>
                        <rim:Value>$creationTime</rim:Value>
                    </rim:ValueList>
                </rim:Slot>
                <rim:Slot name="languageCode">
                    <rim:ValueList>
                        <rim:Value>$languageCode</rim:Value>
                    </rim:ValueList>
                </rim:Slot>

                <rim:Slot name="sourcePatientId">
                    <rim:ValueList>
                        <rim:Value>$sourcePatientId</rim:Value>
                    </rim:ValueList>
                </rim:Slot>
                <rim:Slot name="hash">
                    <rim:ValueList>
                        <rim:Value>$hash</rim:Value>
                    </rim:ValueList>
                </rim:Slot>
                <rim:Slot name="size">
                    <rim:ValueList>
                        <rim:Value>$size</rim:Value>
                    </rim:ValueList>
                </rim:Slot>
                <!--<rim:Slot name="sourcePatientInfo">
                    <rim:ValueList>
                        <rim:Value>PID-3|33334455^^^&amp;1.3.6.1.4.1.21367.2010.1.2.108&amp;ISO</rim:Value>
                        <rim:Value>PID-5|DePinto^Susan^F^II^Mr.</rim:Value>
                        <rim:Value>PID-8|M</rim:Value>
                        <rim:Value>PID-7|20090805</rim:Value>
                        <rim:Value>PID-11|700 Euclid Ave^^St. Louis^MO^63110^USA</rim:Value>
                    </rim:ValueList>
                </rim:Slot>-->
                <rim:Name>
                    <rim:LocalizedString value="$docTitle"/>
                </rim:Name>
                <rim:Description>
                    <rim:LocalizedString value=""/>
                </rim:Description>
                <!-- AUTHOR TODO IN STEP 2 -->
              <!--  <rim:Classification id="cl-$docUUID-1" classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="$docUUID" nodeRepresentation="">
                    <rim:Slot name="authorPerson">
                        <rim:ValueList>
                            <rim:Value>2.3.515.3.12345^DePinto^John^F^II^Mr.^^^IHENA&amp;1.3.6.1.4.1.21367.2010.1.2.300&amp;ISO</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                    <rim:Slot name="authorInstitution">
                        <rim:ValueList>
                            <rim:Value>Great NC RHIO</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                    <rim:Slot name="authorSpecialty">
                        <rim:ValueList>
                            <rim:Value>483</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                </rim:Classification>-->

                <rim:Classification id="cl-$docUUID-2" classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="$docUUID" nodeRepresentation="44943-9">
                    <rim:Slot name="codingScheme">
                        <rim:ValueList>
                            <rim:Value>2.16.840.1.113883.6.1</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                    <rim:Name>
                        <rim:LocalizedString value="unobtainable"/>
                    </rim:Name>
                </rim:Classification>
                <rim:Classification id="cl-$docUUID-3" classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="$docUUID" nodeRepresentation="$formatCode">
                    <rim:Slot name="codingScheme">
                        <rim:ValueList>
                            <rim:Value>Connect-a-thon formatCodes</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                    <rim:Name>
                        <rim:LocalizedString value="$formatCodeLocalized"/>
                    </rim:Name>
                </rim:Classification>
                <rim:Classification id="cl-$docUUID-4" classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="$docUUID" nodeRepresentation="$practiceSettingCode">
                    <rim:Slot name="codingScheme">
                        <rim:ValueList>
                            <rim:Value>Connect-a-thon practiceSettingCodes</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                    <rim:Name>
                        <rim:LocalizedString value="$practiceSettingCode"/>
                    </rim:Name>
                </rim:Classification>
                <rim:Classification id="cl-$docUUID-5" classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="$docUUID" nodeRepresentation="$healthcareFacilityTypeCode">
                    <rim:Slot name="codingScheme">
                        <rim:ValueList>
                            <rim:Value>Connect-a-thon healthcareFacilityTypeCodes</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                    <rim:Name>
                        <rim:LocalizedString value="$healthcareFacilityTypeCode"/>
                    </rim:Name>
                </rim:Classification>

                <rim:Classification id="cl-$docUUID-7" classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="$docUUID" nodeRepresentation="$confidentialityCode">
                    <rim:Slot name="codingScheme">
                        <rim:ValueList>
                            <rim:Value>Connect-a-thon confidentialityCodes</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                    <rim:Name>
                        <rim:LocalizedString value="$confidentialityCodeLocalized"/>
                    </rim:Name>
                </rim:Classification>
                <rim:ExternalIdentifier id="ei-$docUUID-1" registryObject="$docUUID" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" value="$patientId">
                    <rim:Name>
                        <rim:LocalizedString value="XDSDocumentEntry.patientId"/>
                    </rim:Name>
                </rim:ExternalIdentifier>
                <rim:ExternalIdentifier id="ei-$docUUID-2" registryObject="$docUUID" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" value="$XDSDocumentEntry.uniqueId">
                    <rim:Name>
                        <rim:LocalizedString value="XDSDocumentEntry.uniqueId"/>
                    </rim:Name>
                </rim:ExternalIdentifier>
            </rim:ExtrinsicObject>
            <rim:RegistryPackage id="SubmissionSet">
                <rim:Slot name="submissionTime">
                    <rim:ValueList>
                        <rim:Value>$submissionTime</rim:Value>
                    </rim:ValueList>
                </rim:Slot>
                <rim:Name>
                    <rim:LocalizedString value="Submission Set"/>
                </rim:Name>
                <rim:Description>
                    <rim:LocalizedString value="Submission of document uploaded to exchange"/>
                </rim:Description>
                <!-- AUTHOR TODO IN STEP 2 -->
                <!-- <rim:Classification id="cl-ss1" classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="SubmissionSet" nodeRepresentation="">
                    <rim:Slot name="authorPerson">
                        <rim:ValueList>
                            <rim:Value>2.3.515.3.12345^DePinto^John^F^II^Mr.^^^IHENA&amp;1.3.6.1.4.1.21367.2010.1.2.300&amp;ISO</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                    <rim:Slot name="authorInstitution">
                        <rim:ValueList>
                            <rim:Value>Great NC RHIO</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                    <rim:Slot name="authorSpecialty">
                        <rim:ValueList>
                            <rim:Value>483</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                </rim:Classification> -->
                <rim:Classification id="cl-ss2" classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="SubmissionSet" nodeRepresentation="$contentTypeCode">
                    <rim:Slot name="codingScheme">
                        <rim:ValueList>
                            <rim:Value>Connect-a-thon contentTypeCodes</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                    <rim:Name>
                        <rim:LocalizedString value="$contentTypeCodeLocalized"/>
                    </rim:Name>
                </rim:Classification>
                <rim:ExternalIdentifier id="ei-ss1" registryObject="SubmissionSet" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" value="$patientId">
                    <rim:Name>
                        <rim:LocalizedString value="XDSSubmissionSet.patientId"/>
                    </rim:Name>
                </rim:ExternalIdentifier>
                <rim:ExternalIdentifier id="ei-ss2" registryObject="SubmissionSet" identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" value="$XDSSubmissionSet.sourceId">
                    <rim:Name>
                        <rim:LocalizedString value="XDSSubmissionSet.sourceId"/>
                    </rim:Name>
                </rim:ExternalIdentifier>
                <rim:ExternalIdentifier id="ei-ss3" registryObject="SubmissionSet" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" value="$XDSSubmissionSet.uniqueId">
                    <rim:Name>
                        <rim:LocalizedString value="XDSSubmissionSet.uniqueId"/>
                    </rim:Name>
                </rim:ExternalIdentifier>
            </rim:RegistryPackage>
            <rim:Classification id="cl-ss0" classifiedObject="SubmissionSet" classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd"/>
            <rim:Association id="as-hasmember" associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" sourceObject="SubmissionSet" targetObject="$docUUID">
                <rim:Slot name="SubmissionSetStatus">
                    <rim:ValueList>
                        <rim:Value>Original</rim:Value>
                    </rim:ValueList>
                </rim:Slot>
            </rim:Association>
        </rim:RegistryObjectList>
</lcm:SubmitObjectsRequest>
        </soap12:Body>
    </soap12:Envelope>
